# -*- coding: utf-8 -*-
'''
@author: a_kayerov
'''
from django.db.models import Sum
from random import random
import openpyxl
from openpyxl.styles import Font

from medicament.oper_with_base import create_new_report, save_doc, get_name, get_period_namef, get_region_name
from medicament.models import Doc2
from _datetime import datetime


def create_report_form2(periodInt, datef):
    ''' Создание новых документов (в новом периоде)
        Возвращает True, если добавление записей прошло успешно
        В противном случае возвращает False
        copy_fields_formX - функция начального заполнения
    '''
    return create_new_report(2,Doc2,periodInt,datef, copy_fields_form2)

def save_doc_form2(request, type, id_doc, mode_comment):
    ''' Сохранить запись Document + комментарий с новой записью в комментрии с действием пользователя
        Установить собственый параментрв DOCx,set_fields_formx, is_valid_formx
    ''' 
    return save_doc(Doc2,set_fields_form2, is_valid_form2, request, type, id_doc, mode_comment)


def copy_fields_form2(ds, dd):
    ''' Копирование полей - указать все поля для копирования 
        Для каждой формы, 
        ВЫЗЫВАЕТСЯ ТОЛЬКО ДЛЯ ДОКУМЕНТОВ В СОСТОЯНИИ ЗАВЕШЕНО- незаполненные и несогласаованные документы такой обработке не подлежат!
    '''
    dd.c2_1 = ds.c2_1
    dd.c2_2 = ds.c2_2
    dd.c2_3 = ds.c2_3
    dd.c2_3_1 = ds.c2_3_1
    dd.c2_3_2 = ds.c2_3_2
    dd.c2_3_3 = ds.c2_3_3
    dd.c2_4 = ds.c2_4
    dd.c2_4_1 = ds.c2_4_1
    dd.c2_4_2 = ds.c2_4_2
    dd.c2_4_3 = ds.c2_4_3
    dd.c2_5 = ds.c2_5
    dd.c2_13_1 = ds.c2_13_1
    dd.c2_13_2 = ds.c2_13_2
    dd.c2_13_3 = ds.c2_13_3
    dd.c2_13_4 = ds.c2_13_4
    dd.c2_13_5 = ds.c2_13_5
    dd.c2_13_6 = ds.c2_13_6
    dd.c2_13_7 = ds.c2_13_7
    dd.c2_13_8 = ds.c2_13_8
    dd.c2_13_9 = ds.c2_13_9
    dd.c2_13_10= ds.c2_13_10
    dd.c2_13_11= ds.c2_13_11
    dd.c2_13_12= ds.c2_13_12
    dd.c2_13_13= ds.c2_13_13
    dd.c2_13_14= ds.c2_13_14
    dd.c2_13_15= ds.c2_13_15
    dd.c2_13_16= ds.c2_13_16
    dd.c2_13_17= ds.c2_13_17
    dd.c2_13_18= ds.c2_13_18
    dd.c2_13_19= ds.c2_13_19
    dd.c2_13_20= ds.c2_13_20
    dd.c2_13_21= ds.c2_13_21
    dd.c2_13_22= ds.c2_13_22
    dd.c2_13_23= ds.c2_13_23
    dd.c2_13_24= ds.c2_13_24
    dd.c2_13_25= ds.c2_13_25
    dd.c2_13_26= ds.c2_13_26
    dd.c2_13_27= ds.c2_13_27
    dd.c2_13_28= ds.c2_13_28
    dd.c2_13_29= ds.c2_13_29
    dd.c2_13_30= ds.c2_13_30
    dd.c2_13_31= ds.c2_13_31
    dd.c2_13_32= ds.c2_13_32
    dd.c2_13_33= ds.c2_13_33
    dd.c2_13_34= ds.c2_13_34
    dd.c2_13_35= ds.c2_13_35
    dd.c2_13_36= ds.c2_13_36
    dd.c2_13_37= ds.c2_13_37
    dd.c2_13_38= ds.c2_13_38
    dd.c2_13_39= ds.c2_13_39
    dd.c2_13_40= ds.c2_13_40
    dd.c2_13_41= ds.c2_13_41
    dd.c2_6   = ds.c2_6
    dd.c2_7   = ds.c2_7
    dd.c2_8   = ds.c2_8
    dd.c2_9   = ds.c2_9
    dd.c2_10  = ds.c2_10
    dd.c2_11  = ds.c2_11
    dd.c2_12  = ds.c2_12
    dd.c2_13  = ds.c2_13
    dd.c2_13_1  = ds.c2_13_1
    dd.c2_13_2  = ds.c2_13_2
    dd.c2_13_3  = ds.c2_13_3
    dd.c2_13_4  = ds.c2_13_4
    dd.c2_13_5  = ds.c2_13_5
    dd.c2_13_6  = ds.c2_13_6
    dd.c2_13_7  = ds.c2_13_7
    dd.c2_13_8  = ds.c2_13_8
    dd.c2_13_9  = ds.c2_13_9
    dd.c2_13_10 = ds.c2_13_10
    dd.c2_13_11 = ds.c2_13_11
    dd.c2_13_12 = ds.c2_13_12
    dd.c2_13_13 = ds.c2_13_13
    dd.c2_13_14 = ds.c2_13_14
    dd.c2_13_15 = ds.c2_13_15
    dd.c2_13_16 = ds.c2_13_16
    dd.c2_13_17 = ds.c2_13_17
    dd.c2_13_18 = ds.c2_13_18
    dd.c2_13_19 = ds.c2_13_19
    dd.c2_13_20 = ds.c2_13_20
    dd.c2_13_21 = ds.c2_13_21
    dd.c2_13_22 = ds.c2_13_22
    dd.c2_13_23 = ds.c2_13_23
    dd.c2_13_24 = ds.c2_13_24
    dd.c2_13_25 = ds.c2_13_25
    dd.c2_13_26 = ds.c2_13_26
    dd.c2_13_27 = ds.c2_13_27
    dd.c2_13_28 = ds.c2_13_28
    dd.c2_13_29 = ds.c2_13_29
    dd.c2_13_30 = ds.c2_13_30
    dd.c2_13_31 = ds.c2_13_31
    dd.c2_13_32 = ds.c2_13_32
    dd.c2_13_33 = ds.c2_13_33
    dd.c2_13_34 = ds.c2_13_34
    dd.c2_13_35 = ds.c2_13_35
    dd.c2_13_36 = ds.c2_13_36
    dd.c2_13_37 = ds.c2_13_37
    dd.c2_13_38 = ds.c2_13_38
    dd.c2_13_39 = ds.c2_13_39
    dd.c2_13_40 = ds.c2_13_40
    dd.c2_13_41 = ds.c2_13_41
    dd.c2_13_42 = ds.c2_13_42
    dd.c2_13_43 = ds.c2_13_43
    dd.c2_13_44 = ds.c2_13_44
    dd.c2_13_45 = ds.c2_13_45
    dd.c2_13_46 = ds.c2_13_46
    dd.c2_13_47 = ds.c2_13_47
    dd.c2_13_48 = ds.c2_13_48
    dd.c2_13_49 = ds.c2_13_49
    dd.c2_13_50 = ds.c2_13_50
    dd.c2_13_51 = ds.c2_13_51
    dd.c2_13_52 = ds.c2_13_52
    dd.c2_13_53 = ds.c2_13_53
    dd.c2_13_54 = ds.c2_13_54
    dd.c2_13_55 = ds.c2_13_55
    dd.c2_13_56 = ds.c2_13_56
    dd.c2_13_57 = ds.c2_13_57
    dd.c2_13_58 = ds.c2_13_58
    dd.c2_13_59 = ds.c2_13_59
    dd.c2_13_60 = ds.c2_13_60
    dd.c2_13_61 = ds.c2_13_61
    dd.c2_13_62 = ds.c2_13_62
    dd.c2_13_63 = ds.c2_13_63
    dd.c2_13_64 = ds.c2_13_64
    dd.c2_13_65 = ds.c2_13_65
    dd.c2_13_66 = ds.c2_13_66
    dd.c2_13_67 = ds.c2_13_67
    dd.c2_13_68 = ds.c2_13_68
    dd.c2_13_69 = ds.c2_13_69
    dd.c2_13_70 = ds.c2_13_70
    dd.c2_13_71 = ds.c2_13_71
    dd.c2_13_72 = ds.c2_13_72
    dd.c2_13_73 = ds.c2_13_73
    dd.c2_13_74 = ds.c2_13_74
    dd.c2_13_75 = ds.c2_13_75
    dd.c2_13_76 = ds.c2_13_76
    dd.c2_13_77 = ds.c2_13_77
    dd.c2_13_78 = ds.c2_13_78
    dd.c2_13_79 = ds.c2_13_79
    dd.c2_13_80 = ds.c2_13_80
    dd.c2_13_81 = ds.c2_13_81
    dd.c2_13_82 = ds.c2_13_82
    dd.c2_13_83 = ds.c2_13_83
    dd.c2_13_84 = ds.c2_13_84
    dd.c2_13_85 = ds.c2_13_85
    dd.c2_13_86 = ds.c2_13_86
    dd.c2_13_87 = ds.c2_13_87

    dd.c2_13_89 = ds.c2_13_89
    dd.c2_13_90 = ds.c2_13_90
    dd.c2_13_91 = ds.c2_13_91
    dd.c2_13_92 = ds.c2_13_92
    dd.c2_13_93 = ds.c2_13_93
    dd.c2_13_94 = ds.c2_13_94
    dd.c2_13_95 = ds.c2_13_95
    dd.c2_13_96 = ds.c2_13_96
    dd.c2_13_97 = ds.c2_13_97
    dd.c2_13_98 = ds.c2_13_98
    dd.c2_13_99 = ds.c2_13_99
    dd.c2_13_100= ds.c2_13_100
    dd.c2_13_101= ds.c2_13_101
    dd.c2_13_102= ds.c2_13_102
    dd.c2_13_103= ds.c2_13_103
    dd.c2_13_104= ds.c2_13_104
    dd.c2_13_105= ds.c2_13_105
    dd.c2_13_106= ds.c2_13_106
    dd.c2_13_107= ds.c2_13_107
    dd.c2_13_108= ds.c2_13_108
    dd.c2_13_109= ds.c2_13_109
    dd.c2_13_110= ds.c2_13_110
    dd.c2_13_111= ds.c2_13_111
    dd.c2_13_112= ds.c2_13_112
    dd.c2_13_113= ds.c2_13_113
    dd.c2_13_114= ds.c2_13_114
    dd.c2_13_115= ds.c2_13_115
    dd.c2_13_116= ds.c2_13_116
    dd.c2_13_117= ds.c2_13_117
    dd.c2_13_118= ds.c2_13_118
    dd.c2_13_119= ds.c2_13_119
    dd.c2_13_120= ds.c2_13_120
    dd.c2_13_121= ds.c2_13_121
    dd.c2_13_122= ds.c2_13_122
    dd.c2_13_123= ds.c2_13_123
    dd.c2_13_124= ds.c2_13_124
    dd.c2_14= ds.c2_14
    dd.c2_14_1  = ds.c2_14_1
    dd.c2_14_2  = ds.c2_14_2
    dd.c2_14_3  = ds.c2_14_3
    dd.c2_14_4  = ds.c2_14_4
    dd.c2_14_5  = ds.c2_14_5
    dd.c2_14_6  = ds.c2_14_6
    dd.c2_14_7  = ds.c2_14_7
    dd.c2_14_8  = ds.c2_14_8
    dd.c2_14_9  = ds.c2_14_9
    dd.c2_14_10 = ds.c2_14_10
    dd.c2_14_11 = ds.c2_14_11
    dd.c2_14_12 = ds.c2_14_12
    dd.c2_14_13 = ds.c2_14_13
    dd.c2_14_14 = ds.c2_14_14
    dd.c2_14_15 = ds.c2_14_15
    dd.c2_14_16 = ds.c2_14_16
    dd.c2_14_17 = ds.c2_14_17
    dd.c2_14_18 = ds.c2_14_18
    dd.c2_14_19 = ds.c2_14_19
    dd.c2_14_20 = ds.c2_14_20
    dd.c2_14_21 = ds.c2_14_21
    dd.c2_14_22 = ds.c2_14_22
    dd.c2_14_23 = ds.c2_14_23
    dd.c2_14_24 = ds.c2_14_24
    dd.c2_14_25 = ds.c2_14_25
    dd.c2_14_26 = ds.c2_14_26
    dd.c2_14_27 = ds.c2_14_27
    dd.c2_14_28 = ds.c2_14_28
    dd.c2_14_29 = ds.c2_14_29
    dd.c2_14_30 = ds.c2_14_30
    dd.c2_14_31 = ds.c2_14_31
    dd.c2_14_32 = ds.c2_14_32
    dd.c2_14_33 = ds.c2_14_33
    dd.c2_14_34 = ds.c2_14_34
    dd.c2_14_35 = ds.c2_14_35
    dd.c2_14_36 = ds.c2_14_36
    dd.c2_14_37 = ds.c2_14_37
    dd.c2_14_38 = ds.c2_14_38
    dd.c2_14_39 = ds.c2_14_39
    dd.c2_14_40 = ds.c2_14_40
    dd.c2_14_41 = ds.c2_14_41
    dd.c2_14_42 = ds.c2_14_42
    dd.c2_14_43 = ds.c2_14_43
    dd.c2_14_44 = ds.c2_14_44
    dd.c2_14_45 = ds.c2_14_45
    dd.c2_15 = ds.c2_15
    dd.c2_16 = ds.c2_16
    dd.c2_17 = ds.c2_17
    dd.c2_18 = ds.c2_18
    dd.c2_19 = ds.c2_19
    dd.c2_20 = ds.c2_20
    dd.c2_21 = ds.c2_21
    dd.c2_22 = ds.c2_22
    dd.c2_23 = ds.c2_23
    dd.c2_24 = ds.c2_24
    dd.c2_25 = ds.c2_25
    dd.c2_26 = ds.c2_26
    dd.c2_27 = ds.c2_27
    dd.c2_28 = ds.c2_28
    dd.c3_1  = ds.c3_1
    dd.c3_2  = ds.c3_2
    dd.c3_3  = ds.c3_3
    dd.c3_4  = ds.c3_4
    dd.c3_5  = ds.c3_5
    dd.c3_6  = ds.c3_6
    dd.c3_7  = ds.c3_7
    dd.c3_8  = ds.c3_8
    dd.c3_9  = ds.c3_9
    dd.c3_10 = ds.c3_10
    dd.c3_11 = ds.c3_11
    dd.c3_12 = ds.c3_12
    dd.c3_13 = ds.c3_13
    dd.c3_14 = ds.c3_14
    dd.c3_15 = ds.c3_15
    dd.c3_16 = ds.c3_16
    dd.c3_17 = ds.c3_17
    dd.c3_18 = ds.c3_18
    dd.c3_19 = ds.c3_19
    dd.c3_20 = ds.c3_20
    dd.c3_21 = ds.c3_21
    dd.c3_22 = ds.c3_22
    dd.c3_23 = ds.c3_23
    dd.c3_24 = ds.c3_24
    dd.c3_25 = ds.c3_25
    dd.c3_26 = ds.c3_26
    dd.c3_27 = ds.c3_27
    dd.c3_28 = ds.c3_28
    dd.c3_29 = ds.c3_29
    dd.c3_30 = ds.c3_30
    dd.c3_31 = ds.c3_31
    dd.c3_32 = ds.c3_32
    dd.c3_33 = ds.c3_33
    dd.c3_34 = ds.c3_34
    dd.c3_35 = ds.c3_35
    dd.c3_36 = ds.c3_36
    dd.c3_37 = ds.c3_37
    dd.c3_38 = ds.c3_38
    dd.c4_1  = ds.c4_1
    dd.c4_2  = ds.c4_2
    dd.c4_3  = ds.c4_3
    dd.c4_4  = ds.c4_4
    dd.c4_5  = ds.c4_5
    dd.c4_6  = ds.c4_6
    dd.c4_7  = ds.c4_7
    dd.c4_8  = ds.c4_8
    dd.c4_9  = ds.c4_9
    dd.c4_10 = ds.c4_10
    dd.c4_11 = ds.c4_11
    dd.c4_12 = ds.c4_12
    dd.c4_13 = ds.c4_13
    dd.c4_14 = ds.c4_14
    dd.c4_15 = ds.c4_15
     

def set_fields_form2(request, doc):
    ''' Заполнение полей модели данными формы . 
        Для каждой формы
    '''
    doc.c2_1 = request.POST['c2_1'] 
    doc.c2_2 = request.POST['c2_2'] 
    doc.c2_3 = request.POST['c2_3'] 
    doc.c2_3_1 = request.POST['c2_3_1'] 
    doc.c2_3_2 = request.POST['c2_3_2'] 
    doc.c2_3_3 = request.POST['c2_3_3'] 
    doc.c2_4 = request.POST['c2_4'] 
    doc.c2_4_1 = request.POST['c2_4_1'] 
    doc.c2_4_2 = request.POST['c2_4_2'] 
    doc.c2_4_3 = request.POST['c2_4_3'] 
    doc.c2_5 = request.POST['c2_5'] 
    doc.c2_5_1 = request.POST['c2_5_1'] 
    doc.c2_5_2 = request.POST['c2_5_2'] 
    doc.c2_5_3 = request.POST['c2_5_3'] 
    doc.c2_5_4 = request.POST['c2_5_4'] 
    doc.c2_5_5 = request.POST['c2_5_5'] 
    doc.c2_5_6 = request.POST['c2_5_6'] 
    doc.c2_5_7 = request.POST['c2_5_7'] 
    doc.c2_5_8 = request.POST['c2_5_8'] 
    doc.c2_5_9 = request.POST['c2_5_9'] 
    doc.c2_5_10 = request.POST['c2_5_10'] 
    doc.c2_5_11 = request.POST['c2_5_11'] 
    doc.c2_5_12 = request.POST['c2_5_12'] 
    doc.c2_5_13 = request.POST['c2_5_13'] 
    doc.c2_5_14 = request.POST['c2_5_14'] 
    doc.c2_5_15 = request.POST['c2_5_15'] 
    doc.c2_5_16 = request.POST['c2_5_16'] 
    doc.c2_5_17 = request.POST['c2_5_17'] 
    doc.c2_5_18 = request.POST['c2_5_18'] 
    doc.c2_5_19 = request.POST['c2_5_19'] 
    doc.c2_5_20 = request.POST['c2_5_20'] 
    doc.c2_5_21 = request.POST['c2_5_21'] 
    doc.c2_5_22 = request.POST['c2_5_22'] 
    doc.c2_5_23 = request.POST['c2_5_23'] 
    doc.c2_5_24 = request.POST['c2_5_24'] 
    doc.c2_5_25 = request.POST['c2_5_25'] 
    doc.c2_5_26 = request.POST['c2_5_26'] 
    doc.c2_5_27 = request.POST['c2_5_27'] 
    doc.c2_5_28 = request.POST['c2_5_28'] 
    doc.c2_5_29 = request.POST['c2_5_29'] 
    doc.c2_5_30 = request.POST['c2_5_30'] 
    doc.c2_5_31 = request.POST['c2_5_31'] 
    doc.c2_5_32 = request.POST['c2_5_32'] 
    doc.c2_5_33 = request.POST['c2_5_33'] 
    doc.c2_5_34 = request.POST['c2_5_34'] 
    doc.c2_5_35 = request.POST['c2_5_35'] 
    doc.c2_5_36 = request.POST['c2_5_36'] 
    doc.c2_5_37 = request.POST['c2_5_37'] 
    doc.c2_5_38 = request.POST['c2_5_38'] 
    doc.c2_5_39 = request.POST['c2_5_39'] 
    doc.c2_5_40 = request.POST['c2_5_40'] 
    doc.c2_5_41 = request.POST['c2_5_41'] 
    doc.c2_6 = request.POST['c2_6'] 
    doc.c2_7 = request.POST['c2_7'] 
    doc.c2_8 = request.POST['c2_8'] 
    doc.c2_9 = request.POST['c2_9'] 
    doc.c2_10 = request.POST['c2_10'] 
    doc.c2_11 = request.POST['c2_11'] 
    doc.c2_12 = request.POST['c2_12'] 
    doc.c2_13 = request.POST['c2_13'] 
    doc.c2_13_1 = request.POST['c2_13_1'] 
    doc.c2_13_2 = request.POST['c2_13_2'] 
    doc.c2_13_3 = request.POST['c2_13_3'] 
    doc.c2_13_4 = request.POST['c2_13_4'] 
    doc.c2_13_5 = request.POST['c2_13_5'] 
    doc.c2_13_6 = request.POST['c2_13_6'] 
    doc.c2_13_7 = request.POST['c2_13_7'] 
    doc.c2_13_8 = request.POST['c2_13_8'] 
    doc.c2_13_9 = request.POST['c2_13_9'] 
    doc.c2_13_10 = request.POST['c2_13_10'] 
    doc.c2_13_11 = request.POST['c2_13_11'] 
    doc.c2_13_12 = request.POST['c2_13_12'] 
    doc.c2_13_13 = request.POST['c2_13_13'] 
    doc.c2_13_14 = request.POST['c2_13_14'] 
    doc.c2_13_15 = request.POST['c2_13_15'] 
    doc.c2_13_16 = request.POST['c2_13_16'] 
    doc.c2_13_17 = request.POST['c2_13_17'] 
    doc.c2_13_18 = request.POST['c2_13_18'] 
    doc.c2_13_19 = request.POST['c2_13_19'] 
    doc.c2_13_20 = request.POST['c2_13_20'] 
    doc.c2_13_21 = request.POST['c2_13_21'] 
    doc.c2_13_22 = request.POST['c2_13_22'] 
    doc.c2_13_23 = request.POST['c2_13_23'] 
    doc.c2_13_24 = request.POST['c2_13_24'] 
    doc.c2_13_25 = request.POST['c2_13_25'] 
    doc.c2_13_26 = request.POST['c2_13_26'] 
    doc.c2_13_27 = request.POST['c2_13_27'] 
    doc.c2_13_28 = request.POST['c2_13_28'] 
    doc.c2_13_29 = request.POST['c2_13_29'] 
    doc.c2_13_30 = request.POST['c2_13_30'] 
    doc.c2_13_31 = request.POST['c2_13_31'] 
    doc.c2_13_32 = request.POST['c2_13_32'] 
    doc.c2_13_33 = request.POST['c2_13_33'] 
    doc.c2_13_34 = request.POST['c2_13_34'] 
    doc.c2_13_35 = request.POST['c2_13_35'] 
    doc.c2_13_36 = request.POST['c2_13_36'] 
    doc.c2_13_37 = request.POST['c2_13_37'] 
    doc.c2_13_38 = request.POST['c2_13_38'] 
    doc.c2_13_39 = request.POST['c2_13_39'] 
    doc.c2_13_40 = request.POST['c2_13_40'] 
    doc.c2_13_41 = request.POST['c2_13_41'] 
    doc.c2_13_42 = request.POST['c2_13_42'] 
    doc.c2_13_43 = request.POST['c2_13_43'] 
    doc.c2_13_44 = request.POST['c2_13_44'] 
    doc.c2_13_45 = request.POST['c2_13_45'] 
    doc.c2_13_46 = request.POST['c2_13_46'] 
    doc.c2_13_47 = request.POST['c2_13_47'] 
    doc.c2_13_48 = request.POST['c2_13_48'] 
    doc.c2_13_49 = request.POST['c2_13_49'] 
    doc.c2_13_50 = request.POST['c2_13_50'] 
    doc.c2_13_51 = request.POST['c2_13_51'] 
    doc.c2_13_52 = request.POST['c2_13_52'] 
    doc.c2_13_53 = request.POST['c2_13_53'] 
    doc.c2_13_54 = request.POST['c2_13_54'] 
    doc.c2_13_55 = request.POST['c2_13_55'] 
    doc.c2_13_56 = request.POST['c2_13_56'] 
    doc.c2_13_57 = request.POST['c2_13_57'] 
    doc.c2_13_58 = request.POST['c2_13_58'] 
    doc.c2_13_59 = request.POST['c2_13_59'] 
    doc.c2_13_60 = request.POST['c2_13_60'] 
    doc.c2_13_61 = request.POST['c2_13_61'] 
    doc.c2_13_62 = request.POST['c2_13_62'] 
    doc.c2_13_63 = request.POST['c2_13_63'] 
    doc.c2_13_64 = request.POST['c2_13_64'] 
    doc.c2_13_65 = request.POST['c2_13_65'] 
    doc.c2_13_66 = request.POST['c2_13_66'] 
    doc.c2_13_67 = request.POST['c2_13_67'] 
    doc.c2_13_68 = request.POST['c2_13_68'] 
    doc.c2_13_69 = request.POST['c2_13_69'] 
    doc.c2_13_70 = request.POST['c2_13_70'] 
    doc.c2_13_71 = request.POST['c2_13_71'] 
    doc.c2_13_72 = request.POST['c2_13_72'] 
    doc.c2_13_73 = request.POST['c2_13_73'] 
    doc.c2_13_74 = request.POST['c2_13_74'] 
    doc.c2_13_75 = request.POST['c2_13_75'] 
    doc.c2_13_76 = request.POST['c2_13_76'] 
    doc.c2_13_77 = request.POST['c2_13_77'] 
    doc.c2_13_78 = request.POST['c2_13_78'] 
    doc.c2_13_79 = request.POST['c2_13_79'] 
    doc.c2_13_80 = request.POST['c2_13_80'] 
    doc.c2_13_81 = request.POST['c2_13_81'] 
    doc.c2_13_82 = request.POST['c2_13_82'] 
    doc.c2_13_83 = request.POST['c2_13_83'] 
    doc.c2_13_84 = request.POST['c2_13_84'] 
    doc.c2_13_85 = request.POST['c2_13_85'] 
    doc.c2_13_86 = request.POST['c2_13_86'] 
    doc.c2_13_87 = request.POST['c2_13_87'] 

    doc.c2_13_89 = request.POST['c2_13_89'] 
    doc.c2_13_90 = request.POST['c2_13_90'] 
    doc.c2_13_91 = request.POST['c2_13_91'] 
    doc.c2_13_92 = request.POST['c2_13_92'] 
    doc.c2_13_93 = request.POST['c2_13_93'] 
    doc.c2_13_94 = request.POST['c2_13_94'] 
    doc.c2_13_95 = request.POST['c2_13_95'] 
    doc.c2_13_96 = request.POST['c2_13_96'] 
    doc.c2_13_97 = request.POST['c2_13_97'] 
    doc.c2_13_98 = request.POST['c2_13_98'] 
    doc.c2_13_99 = request.POST['c2_13_99'] 
    doc.c2_13_101 = request.POST['c2_13_101'] 
    doc.c2_13_102 = request.POST['c2_13_102'] 
    doc.c2_13_103 = request.POST['c2_13_103'] 
    doc.c2_13_104 = request.POST['c2_13_104'] 
    doc.c2_13_105 = request.POST['c2_13_105'] 
    doc.c2_13_106 = request.POST['c2_13_106'] 
    doc.c2_13_107 = request.POST['c2_13_107'] 
    doc.c2_13_108 = request.POST['c2_13_108'] 
    doc.c2_13_109 = request.POST['c2_13_109'] 
    doc.c2_13_110 = request.POST['c2_13_110'] 
    doc.c2_13_111 = request.POST['c2_13_111'] 
    doc.c2_13_112 = request.POST['c2_13_112'] 
    doc.c2_13_113 = request.POST['c2_13_113'] 
    doc.c2_13_114 = request.POST['c2_13_114'] 
    doc.c2_13_115 = request.POST['c2_13_115'] 
    doc.c2_13_116 = request.POST['c2_13_116'] 
    doc.c2_13_117 = request.POST['c2_13_117'] 
    doc.c2_13_118 = request.POST['c2_13_118'] 
    doc.c2_13_119 = request.POST['c2_13_119'] 
    doc.c2_13_120 = request.POST['c2_13_120'] 
    doc.c2_13_121 = request.POST['c2_13_121'] 
    doc.c2_13_122 = request.POST['c2_13_122'] 
    doc.c2_13_123 = request.POST['c2_13_123'] 
    doc.c2_13_124 = request.POST['c2_13_124'] 
    doc.c2_14 = request.POST['c2_14'] 
    doc.c2_14_1 = request.POST['c2_14_1'] 
    doc.c2_14_2 = request.POST['c2_14_2'] 
    doc.c2_14_3 = request.POST['c2_14_3'] 
    doc.c2_14_4 = request.POST['c2_14_4'] 
    doc.c2_14_5 = request.POST['c2_14_5'] 
    doc.c2_14_6 = request.POST['c2_14_6'] 
    doc.c2_14_7 = request.POST['c2_14_7'] 
    doc.c2_14_8 = request.POST['c2_14_8'] 
    doc.c2_14_9 = request.POST['c2_14_9'] 
    doc.c2_14_10 = request.POST['c2_14_10'] 
    doc.c2_14_11 = request.POST['c2_14_11'] 
    doc.c2_14_12 = request.POST['c2_14_12'] 
    doc.c2_14_13 = request.POST['c2_14_13'] 
    doc.c2_14_14 = request.POST['c2_14_14'] 
    doc.c2_14_14 = request.POST['c2_14_14'] 
    doc.c2_14_15 = request.POST['c2_14_15'] 
    doc.c2_14_16 = request.POST['c2_14_16'] 
    doc.c2_14_17 = request.POST['c2_14_17'] 
    doc.c2_14_18 = request.POST['c2_14_18'] 
    doc.c2_14_19 = request.POST['c2_14_19'] 
    doc.c2_14_20 = request.POST['c2_14_20'] 
    doc.c2_14_21 = request.POST['c2_14_21'] 
    doc.c2_14_22 = request.POST['c2_14_22'] 
    doc.c2_14_23 = request.POST['c2_14_23'] 
    doc.c2_14_24 = request.POST['c2_14_24'] 
    doc.c2_14_25 = request.POST['c2_14_25'] 
    doc.c2_14_26 = request.POST['c2_14_26'] 
    doc.c2_14_27 = request.POST['c2_14_27'] 
    doc.c2_14_28 = request.POST['c2_14_28'] 
    doc.c2_14_29 = request.POST['c2_14_29'] 
    doc.c2_14_30 = request.POST['c2_14_30'] 
    doc.c2_14_31 = request.POST['c2_14_31'] 
    doc.c2_14_32 = request.POST['c2_14_32'] 
    doc.c2_14_33 = request.POST['c2_14_33'] 
    doc.c2_14_34 = request.POST['c2_14_34'] 
    doc.c2_14_35 = request.POST['c2_14_35'] 
    doc.c2_14_36 = request.POST['c2_14_36'] 
    doc.c2_14_37 = request.POST['c2_14_37'] 
    doc.c2_14_38 = request.POST['c2_14_38'] 
    doc.c2_14_39 = request.POST['c2_14_39'] 
    doc.c2_14_40 = request.POST['c2_14_40'] 
    doc.c2_14_41 = request.POST['c2_14_41'] 
    doc.c2_14_42 = request.POST['c2_14_42'] 
    doc.c2_14_43 = request.POST['c2_14_43'] 
    doc.c2_14_44 = request.POST['c2_14_44'] 
    doc.c2_14_45 = request.POST['c2_14_45'] 
    doc.c2_15 = request.POST['c2_15'] 
    doc.c2_16 = request.POST['c2_16'] 
    doc.c2_17 = request.POST['c2_17'] 
    doc.c2_18 = request.POST['c2_18'] 
    doc.c2_19 = request.POST['c2_19'] 
    doc.c2_20 = request.POST['c2_20'] 
    doc.c2_21 = request.POST['c2_21'] 
    doc.c2_22 = request.POST['c2_22'] 
    doc.c2_23 = request.POST['c2_23'] 
    doc.c2_24 = request.POST['c2_24'] 
    doc.c2_25 = request.POST['c2_25'] 
    doc.c2_26 = request.POST['c2_26'] 
    doc.c2_27 = request.POST['c2_27'] 
    doc.c2_28 = request.POST['c2_28'] 

    doc.c3_1 = request.POST['c3_1'] 
    doc.c3_2 = request.POST['c3_2'] 
    doc.c3_3 = request.POST['c3_3'] 
    doc.c3_4 = request.POST['c3_4'] 
    doc.c3_5 = request.POST['c3_5'] 
    doc.c3_6 = request.POST['c3_6'] 
    doc.c3_7 = request.POST['c3_7'] 
    doc.c3_8 = request.POST['c3_8'] 
    doc.c3_9 = request.POST['c3_9'] 
    doc.c3_10 = request.POST['c3_10'] 
    doc.c3_11 = request.POST['c3_11'] 
    doc.c3_12 = request.POST['c3_12'] 
    doc.c3_13 = request.POST['c3_13'] 
    doc.c3_14 = request.POST['c3_14'] 
    doc.c3_15 = request.POST['c3_15'] 
    doc.c3_16 = request.POST['c3_16'] 
    doc.c3_17 = request.POST['c3_17'] 
    doc.c3_18 = request.POST['c3_18'] 
    doc.c3_19 = request.POST['c3_19'] 
    doc.c3_20 = request.POST['c3_20'] 
    doc.c3_21 = request.POST['c3_21'] 
    doc.c3_22 = request.POST['c3_22'] 
    doc.c3_23 = request.POST['c3_23'] 
    doc.c3_24 = request.POST['c3_24'] 
    doc.c3_25 = request.POST['c3_25'] 
    doc.c3_26 = request.POST['c3_26'] 
    doc.c3_27 = request.POST['c3_27'] 
    doc.c3_28 = request.POST['c3_28'] 
    doc.c3_29 = request.POST['c3_29'] 
    doc.c3_30 = request.POST['c3_30'] 
    doc.c3_31 = request.POST['c3_31'] 
    doc.c3_32 = request.POST['c3_32'] 
    doc.c3_33 = request.POST['c3_33'] 
    doc.c3_34 = request.POST['c3_34'] 
    doc.c3_35 = request.POST['c3_35'] 
    doc.c3_36 = request.POST['c3_36'] 
    doc.c3_37 = request.POST['c3_37'] 
    doc.c3_38 = request.POST['c3_38'] 
    doc.c4_1 = request.POST['c4_1'] 
    doc.c4_2 = request.POST['c4_2'] 
    doc.c4_3 = request.POST['c4_3'] 
    doc.c4_4 = request.POST['c4_4'] 
    doc.c4_5 = request.POST['c4_5'] 
    doc.c4_6 = request.POST['c4_6'] 
    doc.c4_7 = request.POST['c4_7'] 
    doc.c4_8 = request.POST['c4_8'] 
    doc.c4_9 = request.POST['c4_9'] 
    doc.c4_10 = request.POST['c4_10'] 
    doc.c4_11 = request.POST['c4_11'] 
    doc.c4_12 = request.POST['c4_12'] 
    doc.c4_13 = request.POST['c4_13'] 
    doc.c4_14 = request.POST['c4_14'] 
    doc.c4_15 = request.POST['c4_15'] 
    


def is_valid_form2(doc, doc_prev):
    ''' Проверка заполнения формы на корректность 
        Специфично для каждой формы
    '''
    ret = [True,'OK']
    return ret

def calc_sum_form2(doc):
    ''' Возвращает Суммы данных отчетов
    '''
#    assert False
    aq0= doc.aggregate(Sum('c2_1'),Sum('c2_2'),Sum('c2_3'),Sum('c2_3_1'),Sum('c2_3_2'), Sum('c2_3_3'), \
                       Sum('c2_4'),Sum('c2_4_1'),Sum('c2_4_2'),Sum('c2_4_3'), \
         Sum('c2_5'), Sum('c2_5_1'),Sum('c2_5_2'),Sum('c2_5_3'),Sum('c2_5_4'),Sum('c2_5_5'),Sum('c2_5_6'),Sum('c2_5_7'),Sum('c2_5_8'),Sum('c2_5_9'), \
         Sum('c2_5_10'),Sum('c2_5_11'),Sum('c2_5_12'),Sum('c2_5_13'),Sum('c2_5_14'),Sum('c2_5_15'),Sum('c2_5_16'),Sum('c2_5_17'),Sum('c2_5_18'),Sum('c2_5_19'), \
         Sum('c2_5_20'),Sum('c2_5_21'),Sum('c2_5_22'),Sum('c2_5_23'),Sum('c2_5_24'),Sum('c2_5_25'),Sum('c2_5_26'),Sum('c2_5_27'),Sum('c2_5_28'),Sum('c2_5_29'), \
         Sum('c2_5_30'),Sum('c2_5_31'),Sum('c2_5_32'),Sum('c2_5_33'),Sum('c2_5_34'),Sum('c2_5_35'),Sum('c2_5_36'),Sum('c2_5_37'),Sum('c2_5_38'),Sum('c2_5_39'), \
         Sum('c2_5_40'),Sum('c2_5_41'), \
         Sum('c2_6'), Sum('c2_7'), Sum('c2_8'),Sum('c2_9'),Sum('c2_10'),Sum('c2_11'),Sum('c2_12'), \
         Sum('c2_13'), Sum('c2_13_1'),Sum('c2_13_2'),Sum('c2_13_3'),Sum('c2_13_4'),Sum('c2_13_5'),Sum('c2_13_6'),Sum('c2_13_7'),Sum('c2_13_8'),Sum('c2_13_9'), \
         Sum('c2_13_10'), Sum('c2_13_11'),Sum('c2_13_12'),Sum('c2_13_13'),Sum('c2_13_14'),Sum('c2_13_15'),Sum('c2_13_16'),Sum('c2_13_17'),Sum('c2_13_18'),Sum('c2_13_19'), \
         Sum('c2_13_20'), Sum('c2_13_21'),Sum('c2_13_22'),Sum('c2_13_23'),Sum('c2_13_24'),Sum('c2_13_25'),Sum('c2_13_26'),Sum('c2_13_27'),Sum('c2_13_28'),Sum('c2_13_29'), \
         Sum('c2_13_30'), Sum('c2_13_31'),Sum('c2_13_32'),Sum('c2_13_33'),Sum('c2_13_34'),Sum('c2_13_35'),Sum('c2_13_36'),Sum('c2_13_37'),Sum('c2_13_38'),Sum('c2_13_39'), \
         Sum('c2_13_40'), Sum('c2_13_41'),Sum('c2_13_42'),Sum('c2_13_43'),Sum('c2_13_44'),Sum('c2_13_45'),Sum('c2_13_46'),Sum('c2_13_47'),Sum('c2_13_48'),Sum('c2_13_49'), \
         Sum('c2_13_50'), Sum('c2_13_51'),Sum('c2_13_52'),Sum('c2_13_53'),Sum('c2_13_54'),Sum('c2_13_55'),Sum('c2_13_56'),Sum('c2_13_57'),Sum('c2_13_58'),Sum('c2_13_59'), \
         Sum('c2_13_60'), Sum('c2_13_61'),Sum('c2_13_62'),Sum('c2_13_63'),Sum('c2_13_64'),Sum('c2_13_65'),Sum('c2_13_66'),Sum('c2_13_67'),Sum('c2_13_68'),Sum('c2_13_69'), \
         Sum('c2_13_70'), Sum('c2_13_71'),Sum('c2_13_72'),Sum('c2_13_73'),Sum('c2_13_74'),Sum('c2_13_75'),Sum('c2_13_76'),Sum('c2_13_77'),Sum('c2_13_78'),Sum('c2_13_79'), \
         Sum('c2_13_80'), Sum('c2_13_81'),Sum('c2_13_82'),Sum('c2_13_83'),Sum('c2_13_84'),Sum('c2_13_85'),Sum('c2_13_86'),Sum('c2_13_87'),                Sum('c2_13_89'), \
         Sum('c2_13_90'), Sum('c2_13_91'),Sum('c2_13_92'),Sum('c2_13_93'),Sum('c2_13_94'),Sum('c2_13_95'),Sum('c2_13_96'),Sum('c2_13_97'),Sum('c2_13_98'),Sum('c2_13_99'), \
         Sum('c2_13_100'), Sum('c2_13_101'),Sum('c2_13_102'),Sum('c2_13_103'),Sum('c2_13_104'),Sum('c2_13_105'),Sum('c2_13_106'),Sum('c2_13_107'),Sum('c2_13_108'),Sum('c2_13_109'), \
         Sum('c2_13_110'), Sum('c2_13_111'),Sum('c2_13_112'),Sum('c2_13_113'),Sum('c2_13_114'),Sum('c2_13_115'),Sum('c2_13_116'),Sum('c2_13_117'),Sum('c2_13_118'),Sum('c2_13_119'), \
         Sum('c2_13_120'), Sum('c2_13_121'),Sum('c2_13_122'),Sum('c2_13_123'),Sum('c2_13_124'), \
         )
    aq1= doc.aggregate( Sum('c2_14'), Sum('c2_14_1'),Sum('c2_14_2'),Sum('c2_14_3'),Sum('c2_14_4'),Sum('c2_14_5'),Sum('c2_14_6'),Sum('c2_14_7'),Sum('c2_14_8'),Sum('c2_14_9'), \
         Sum('c2_14_10'), Sum('c2_14_11'),Sum('c2_14_12'),Sum('c2_14_13'),Sum('c2_14_14'),Sum('c2_14_15'),Sum('c2_14_16'),Sum('c2_14_17'),Sum('c2_14_18'),Sum('c2_14_19'), \
         Sum('c2_14_20'), Sum('c2_14_21'),Sum('c2_14_22'),Sum('c2_14_23'),Sum('c2_14_24'),Sum('c2_14_25'),Sum('c2_14_26'),Sum('c2_14_27'),Sum('c2_14_28'),Sum('c2_14_29'), \
         Sum('c2_14_30'), Sum('c2_14_31'),Sum('c2_14_32'),Sum('c2_14_33'),Sum('c2_14_34'),Sum('c2_14_35'),Sum('c2_14_36'),Sum('c2_14_37'),Sum('c2_14_38'),Sum('c2_14_39'), \
         Sum('c2_14_40'), Sum('c2_14_41'),Sum('c2_14_42'),Sum('c2_14_43'),Sum('c2_14_44'),Sum('c2_14_45'), \
         Sum('c2_15'),Sum('c2_16'),Sum('c2_17'),Sum('c2_18'),Sum('c2_19'),Sum('c2_20'),Sum('c2_21'),Sum('c2_22'),Sum('c2_23'), \
         Sum('c2_24'),Sum('c2_25'),Sum('c2_26'),Sum('c2_27'),Sum('c2_28'), \
         Sum('c3_1'),Sum('c3_2'),Sum('c3_3'),Sum('c3_4'),Sum('c3_5'),Sum('c3_6'),Sum('c3_7'),Sum('c3_8'),Sum('c3_9'), \
         Sum('c3_10'),Sum('c3_11'),Sum('c3_12'),Sum('c3_13'),Sum('c3_14'),Sum('c3_15'),Sum('c3_16'),Sum('c3_17'),Sum('c3_18'),Sum('c3_19'), \
         Sum('c3_20'),Sum('c3_21'),Sum('c3_22'),Sum('c3_23'),Sum('c3_24'),Sum('c3_25'),Sum('c3_26'),Sum('c3_27'),Sum('c3_28'),Sum('c3_29'), \
         Sum('c3_30'),Sum('c3_31'),Sum('c3_32'),Sum('c3_33'),Sum('c3_34'),Sum('c3_35'),Sum('c3_36'),Sum('c3_37'),Sum('c3_38'),\
         Sum('c4_1'),Sum('c4_2'),Sum('c4_3'),Sum('c4_4'),Sum('c4_5'),Sum('c4_6'),Sum('c4_7'),Sum('c4_8'),Sum('c4_9'), \
         Sum('c4_10'),Sum('c4_11'),Sum('c4_12'),Sum('c4_13'),Sum('c4_14'),Sum('c4_15') \
                      )
    
    s = [["2.1. Число врачей (без аспирантов, интернов и ординаторов), работающих в медицинских организациях субъекта Российской Федерации ",0],
         ["2.2. Число среднего медицинского персонала, работающего в медицинских организациях субъекта Российской Федерации",0],
         ["2.3. Число участковых врачей (без аспирантов, интернов и ординаторов), оказывающих медицинскую помощь сельскому населению (выбрать из справочника), всего",0],
         ["2.3.1 Участковый врач терапевт",0],
         ["2.3.2 Участковый врач педиатр",0],
         ["2.3.3 Врач общей практики",0],
         ["2.4. Число среднего медицинского персонала, оказывающего медицинскую помощь сельскому населению (выбрать из справочника), всего",0],
         ["2.4.1 Участковая медицинская сестра врача терапевта",0],
         ["2.4.2 Участковая медицинская сестра врача педиатра",0],
         ["2.4.3 Участковая медицинская сестра врача общей практики",0],
         ["2.5. Число врачей клинических специальностей (выбрать из списка), всего",0],
         ["2.5.1 акушеры-гинекологи",0],
         ["2.5.2 аллергологи-иммунологи",0],
         ["2.5.3 гастроэнтерологи",0],
         ["2.5.4 гематологи",0],
         ["2.5.5 гериатры",0],
         ["2.5.6 дерматовенерологи",0],
         ["2.5.7 диабетологи",0],
         ["2.5.8 инфекционисты",0],
         ["2.5.9 кардиологи",0],
         ["2.5.10 кардиологи детские",0],
         ["2.5.11 колопроктологи",0],
         ["2.5.12 неврологи",0],
         ["2.5.13 нейрохирурги",0],
         ["2.5.14 неонатологи",0],
         ["2.5.15 нефрологи",0],
         ["2.5.16 общей практики (семейные)",0],
         ["2.5.17 онкологи",0],
         ["2.5.18 онкологи детские",0],
         ["2.5.19 оториноларингологи",0],
         ["2.5.20 офтальмологи",0],
         ["2.5.21 педиатры",0],
         ["2.5.22 профпатологи",0],
         ["2.5.23 no рентгенэндоваскулярным диагностике и лечению",0],
         ["2.5.24 психиатры",0],
         ["2.5.25 психиатры-наркологи",0],        
         ["2.5.26 пульмонологи",0],
         ["2.5.27 ревматологи",0],
         ["2.5.28 скорой медицинской помощи",0],
         ["2.5.29 терапевты",0],
         ["2.5.30 травматология и ортопеды",0],
         ["2.5.31 урологи",0],
         ["2.5.32 урологи-андрологи детские",0],
         ["2.5.33 фтизиатры",0],
         ["2.5.34 хирурги",0],
         ["2.5.35 хирурги детские",0],
         ["2.5.36 хирурги пластические",0],
         ["2.5.37 хирурги сердечно-сосудистые",0],
         ["2.5.38 хирурги торакальные",0],
         ["2.5.39 хирурги челюстно-лицевые",0],
         ["2.5.40 эндокринологи",0],
         ["2.5.41 эндокринологи детские",0],         
         ["2.6. Число среднего медицинского персонала, работающих с  врачами клинических специальностей",0],
         ["2.7. Число врачей, работающих в медицинских организациях, оказывающих медицинскую помощь в амбулаторных условиях",0],
         ["2.8. Число занятых  врачебных должностей, оказывающих медицинскую помощь в амбулаторных условиях",0],
         ["2.9. Число среднего медицинского персонала, работающих в медицинских организациях, оказывающих медицинскую помощь в амбулаторных условиях",0],
         ["2.10. Число занятых  должностей  среднего медицинского персонала, оказывающих медицинскую помощь в амбулаторных условиях",0],
         ["2.11. Число штатных должностей врачей, оказывающих медицинскую  помощь в амбулаторных условиях",0],
         ["2.12. Число штатных должностей среднего медицинского персонала, оказывающих медицинскую помощь  в амбулаторных условиях",0],
         ["2.13. Число  врачей дефицитных для субъекта Российской Федерации должностей на конец отчетного периода (выбрать из справочника), всего",0],
         ["2.13.1 акушеры – гинекологи",0],
         ["2.13.2 - их них акушеры – гинекологи цехового врачебного участка",0],
         ["2.13.3 аллергологи – иммунологи",0],
         ["2.13.4 анестезиологи – реаниматологи",0],
         ["2.13.5 бактериологи",0],
         ["2.13.6 вирусологи",0],
         ["2.13.7 врачи здравпунктов",0],
         ["2.13.8 гастроэнтерологи",0],         
         ["2.13.9 гематологи",0],
         ["2.13.10 генетики",0],
         ["2.13.11 гериатры",0],
         ["2.13.12 дезинфектологи",0],
         ["2.13.13 дерматовенерологи",0],
         ["2.13.14 диабетологи",0],
         ["2.13.15 диетологи",0],
         ["2.13.16 инфекционисты",0],
         ["2.13.17 кардиологи",0],
         ["2.13.18 кардиологи детские",0],
         ["2.13.19 клинической лабораторной диагностики",0],
         ["2.13.20 клинические микологи",0],
         ["2.13.21 колопроктологи",0],
         ["2.13.22 косметологи",0],
         ["2.13.23 лаборанты",0],
         ["2.13.24 лабораторные генетики",0],       
         ["2.13.25 лабораторные микологи",0],
         ["2.13.26 мануальной терапии",0],
         ["2.13.27 методисты",0],
         ["2.13.28 неврологи",0],
         ["2.13.29 нейрохирурги",0],
         ["2.13.30 неонатолог",0],
         ["2.13.31 нефрологи",0],
         ["2.13.32 общей практики (семейные)",0],
         ["2.13.33 онкологи",0],
         ["2.13.34 онкологи детские",0],
         ["2.13.35 ортодонты",0],
         ["2.13.36 остеопаты",0],
         ["2.13.37 оториноларингологи",0],
         ["2.13.38 офтальмологи",0],
         ["2.13.39 офтальмологи-протезисты",0],
         ["2.13.40 паразитологи",0],        
         ["2.13.41 патологоанатомы",0],
         ["2.13.42 педиатры – всего",0],
         ["2.13.43 - из них: педиатры участковые (включая педиатров участковых приписных участков)",0],
         ["2.13.44 - педиатры городские (районные)",0],
         ["2.13.45 по авиационной и космической медицине",0],
         ["2.13.46 по водолазной медицине",0],
         ["2.13.47 по гигиене детей и подростков",0],
         ["2.13.48 по гигиене питания",0],
         ["2.13.49 по гигиене труда",0],
         ["2.13.50 по гигиеническому воспитанию",0],
         ["2.13.51 по коммунальной гигиене",0],
         ["2.13.52 по лечебной физкультуре",0],
         ["2.13.53 по медико-социальной экспертизе",0],
         ["2.13.54 по медицинской профилактике",0],
         ["2.13.55 по медицинской реабилитации",0],
         ["2.13.56 по общей гигиене",0],        
         ["2.13.57 по паллиативной медицинской помощи",0],
         ["2.13.58 по радиационной гигиене",0],
         ["2.13.59 по рентгенэдоваскулярным диагностике и лечению",0],
         ["2.13.60 по санитарно-гигиеническим лабораторным исследованиям",0],
         ["2.13.61 по спортивной медицине",0],
         ["2.13.63 профпатологи",0],
         ["2.13.64 психиатры",0],
         ["2.13.65 - из них: участковые",0],
         ["2.13.66 - психиатры детские",0],
         ["2.13.67 - из них психиатры детские участковые",0],
         ["2.13.68 - психиатры подростковые",0],
         ["2.13.69 - из них психиатры подростковые участковые",0],
         ["2.13.70 - психиатры-наркологи",0],
         ["2.13.71 - из них психиатры-наркологи участковые",0],
         ["2.13.72 психотерапевты",0],
         ["2.13.73 пульмонологи",0],        
         ["2.13.74 радиологи",0],
         ["2.13.75 радиотерапевты",0],
         ["2.13.76 ревматологи",0],
         ["2.13.77 рентгенологи",0],
         ["2.13.78 рефлексотерапевты",0],
         ["2.13.79 сексологи",0],
         ["2.13.80 стажеры",0],
         ["2.13.81 статистики",0],
         ["2.13.82 стоматологи",0],
         ["2.13.83 стоматологи детские",0],
         ["2.13.84 стоматологи-ортопеды",0],
         ["2.13.85 стоматологи-терапевты",0],
         ["2.13.86 стоматологи-хирурги",0],
         ["2.13.87 судебно-психиатрические эксперты",0],
         ["2.13.89 судовые врачи",0],
         ["2.13.90 сурдологи-оториноларингологи",0],
         ["2.13.91 сурдологи-протезисты",0],
         ["2.13.92 терапевты - всего",0],
         ["2.13.93 - из них: терапевты участковые",0],
         ["2.13.94 - терапевты участковые цеховых врачебных участков",0],
         ["2.13.95 - терапевты амбулаторий",0],
         ["2.13.96 - терапевты подростковые",0],
         ["2.13.97 токсикологи",0],
         ["2.13.98 травматологи - ортопеды",0],
         ["2.13.99 трансфузиологи",0],         
         ["2.13.100 ультразвуковой диагностики",0],
         ["2.13.101 урологи",0],
         ["2.13.102 урологи-андрологи детские",0],
         ["2.13.103 фармакологи клинические",0],
         ["2.13.104 физиотерапевты",0],
         ["2.13.105 фтизиатры",0],
         ["2.13.106 - из них: фтизиатры участковые",0],
         ["2.13.107 функциональной диагностики",0],
         ["2.13.108 хирурги",0],         
         ["2.13.109 хирурги детские",0],
         ["2.13.110 хирурги пластические",0],
         ["2.13.111 хирурги сердечно-сосудистые",0],
         ["2.13.112 хирурги торакальные",0],
         ["2.13.113 хирурги челюстно-лицевые",0],
         ["2.13.114 эндокринологи",0],
         ["2.13.115 эндокринологи детские",0],
         ["2.13.116 эндоскописты",0],
         ["2.13.117 эпидемиологи",0],         
         ["2.13.118 прочие",0],
         ["2.13.119 Специалисты с высшим немедицинским образованием – всего:",0],
         ["2.13.120 - из них специалисты: биологи",0],
         ["2.13.121 - психологи медицинские",0],
         ["2.13.122 - инструкторы-методисты по лечебной физкультуре",0],
         ["2.13.123 - судебные эксперты",0],
         ["2.13.124 - химики-эксперты",0],
         ["2.14.Число среднего медицинского персонала дефицитных для субъекта Российской Федерации должностей на конец отчетного периода (выбрать из справочника), всего",0],
         ["2.14.1 акушерки",0],         
         ["2.14.2 гигиенисты стоматологические",0],
         ["2.14.3 заведующие",0],
         ["2.14.4 - из них: заведущие фельдшерско-акушерским пунктом",0],
         ["2.14.5 зубные врачи",0],
         ["2.14.6 зубные техники",0],
         ["2.14.7 инструкторы-дезинфекторы",0],
         ["2.14.8 инструкторы по гигиеническому воспитанию",0],
         ["2.14.9 инструкторы по лечебной физкультуре",0],
         ["2.14.10 инструкторы по трудовой терапии",0],         
         ["2.14.11 лаборанты",0],
         ["2.14.12 медицинские лабораторные техники (фельдшеры-лаборанты)",0],
         ["2.14.13 медицинские сестры",0],
         ["2.14.14 - анестезисты",0],
         ["2.14.15 - врачей общей практики (семейных врачей)",0],
         ["2.14.16 - диетические",0],
         ["2.14.17 - медико-социальной помощи",0],
         ["2.14.18 - медицинская сестра (фельдшер) по приему вызовов скорой медицинской помощи и передаче их выездным бригадам скорой медицинской помощи",0],
         ["2.14.19 - операционные",0],         
         ["2.14.20 - палатные (постовые)",0],
         ["2.14.21 - патронажные",0],
         ["2.14.22 - перевязочной",0],
         ["2.14.23 - по косметологии",0],
         ["2.14.24 - по массажу",0],
         ["2.14.25 - приемного отделения",0],
         ["2.14.26 - процедурной",0],
         ["2.14.27 - по реабилитации",0],
         ["2.14.28 - старшие",0],         
         ["2.14.29 - стерилизационной",0],
         ["2.14.30 - участковые врачей-терапевтов участковых",0],
         ["2.14.31 - участковые врачей-педиатров участковых",0],
         ["2.14.32 - по физиотерапии",0],
         ["2.14.33 - по функциональной диагностике",0],
         ["2.14.34 медицинские дезинфекторы",0],
         ["2.14.35 медицинские оптики-оптометристы",0],
         ["2.14.36 медицинские регистраторы",0],
         ["2.14.37 медицинские статистики",0],         
         ["2.14.38 медицинские технологи",0],
         ["2.14.39 помощники врачей",0],
         ["2.14.40 рентгенолаборанты",0],
         ["2.14.41 фельдшеры",0],         
         ["2.14.42 - из них: фельдшеры скорой медицинской помощи",0],
         ["2.14.43 - фельдшеры-наркологи",0],
         ["2.14.44 - фельдшеры-водители скорой медицинской помощи",0],
         ["2.14.45 прочий средний медицинский персонал",0],
         ["2.15.Число участковых врачей терапевтов, работающих в медицинских организациях субъекта Российской Федерации",0],
         ["2.16.Число участковых врачей педиатров, работающих в медицинских организациях субъекта Российской Федерации",0],
         ["2.17.Число врачей общей практики (семейных врачей), работающих в медицинских организациях субъекта Российской Федерации",0],
         ["2.18.Число участковых медицинских сестер участкового врача терапевта",0],
         ["2.19.Число участковых медицинских сестер участкового врача педиатра",0],         
         ["2.20.Число участковых медицинских сестер врача общей практики (семейного врача)",0],
         ["2.21.Число штатных должностей участковых врачей терапевтов",0],
         ["2.22.Число штатных должностей участковых врачей педиатров",0],
         ["2.23.Число штатных должностей врачей общей практики (семейного врача)",0],         
         ["2.24.Число штатных должностей участковых медицинских сестер участкового врача терапевта",0],
         ["2.25.Число штатных должностей участковых медицинских сестер участкового врача педиатра",0],
         ["2.26.Число штатных должностей участковых медицинских сестер врача общей практики (семейного врача)",0],
         ["2.27.Число врачей, привлеченных на работу в медицинские организации субъекта Российской Федерации",0],
         ["2.28.Число среднего медицинского персонала, привлеченного на работу в медицинские организации субъекта Российской Федерации",0],
         ["3.1 Число врачей, получивших жилье из нуждающихся в улучшении жилищных условий, всего, из них",0],
         ["3.2 - по социальному найму",0],
         ["3.3 - служебное жилье",0],
         ["3.4 - предоставление общежития",0],         
         ["3.5 Число врачей, приобретших жилье из нуждающихся в улучшении жилищных условий, всего, из них:",0],
         ["3.6 - с использованием безвозмездной единовременной субсидии (выплаты) на компенсацию части стоимости приобретаемого (строящегося) жилья",0],
         ["3.7 - с использованием безвозмездной единовременной субсидии (выплаты) на компенсацию части платежа по кредитному договору (договору займа)",0],
         ["3.8 - на основе льготного кредитования",0],         
         ["3.9 Число врачей, нуждающихся в улучшении жилищных условий",0],
         ["3.10 Число врачей, обеспеченных жильем, из числа врачей, привлеченных в субъект Российской Федерации",0],
         ["3.11 Число врачей, нуждающихся в улучшении жилищных условий из числа врачей, привлеченных в субъект Российской Федерации",0],
         ["3.12 Число среднего медицинского персонала, получившего жилье из нуждающихся в улучшении жилищных условий, всего, из них:",0],
         ["3.13 - по социальному найму",0],
         ["3.14 - служебное жилье",0],
         ["3.15 - предоставление места в общежитии",0],
         ["3.16 Число среднего медицинского персонала, приобретшего жилье из нуждающихся в улучшении жилищных условий, всего, из них:",0],
         ["3.17 - с использованием безвозмездной единовременной субсидии (выплаты) на компенсацию части стоимости приобретаемого (строящегося) жилья",0],         
         ["3.18 - с использованием безвозмездной единовременной субсидии (выплаты) на компенсацию части платежа по кредитному договору (договору займа)",0],
         ["3.19 - на основе льготного кредитования",0],
         ["3.20 Число среднего медицинского персонала, нуждающихся в улучшении жилищных условий",0],
         ["3.21 Число среднего медицинского персонала, обеспеченных жильем, из числа средних медицинских работников, привлеченных в субъект Российской Федерации",0],         
         ["3.22 Число среднего медицинского персонала, нуждающихся в улучшении жилищных условий из числа средних медицинских работников, привлеченных в субъект Российской Федерации",0],
         ["3.23 Число врачей, получивших безвозмездно земельный участок для строительства (покупки) жилья, всего",0],
         ["3.24 - в том числе, привлеченных в субъект Российской Федерации",0],
         ["3.25 Число среднего медицинского персонала, получивших безвозмездно земельный участок для строительства (покупки) жилья, всего",0],
         ["3.26 - в том числе, привлеченных в субъект Российской Федерации",0],
         ["3.27 Число врачей, получивших компенсацию расходов за аренду жилого помещения",0],
         ["3.28 Число среднего медицинского персонала, получивших компенсацию расходов за аренду жилого помещения",0],
         ["3.29 Число врачей, получивших единовременные денежные выплаты при заключении трудового договора («подъмные»), с указанием программ – Земский доктор, иные",0],
         ["3.30 Число среднего медицинского персонала, получивших единовременные денежные выплаты при заключении трудового договора («подъмные»), с указанием программ – Земский доктор, иные",0],         
         ["3.31 Число врачей, получивших ежемесячные денежные выплаты",0],
         ["3.32 Число среднего медицинского персонала, получивших ежемесячные денежные выплаты",0],
         ["3.33 Число студентов образовательных учреждений высшего профессионального образования, получивших доплаты к стипендиям",0],
         ["3.34 Число студентов образовательных учреждений среднего профессионального образования, получивших доплаты к стипендиям",0],         
         ["3.35 Число врачей, получивших компенсацию расходов на оплату жилищно-коммунальных услуг",0],
         ["3.36 Число среднего медицинского персонала, получивших компенсацию расходов на оплату жилищно-коммунальных услуг",0],
         ["3.37 Число врачей, которые воспользовались внеочередным предоставлением места в дошкольной образовательной организации",0],
         ["3.38 Число среднего медицинского персонала, которые воспользовались внеочередным предоставлением места в дошкольной образовательной организации",0],
         ["3.39 Число муниципальных образований в субъекте Российской Федерации, оказывающих меры социальной поддержки медицинским работникам",0],
         ["3.40 Число муниципальных образований в субъекте Российской Федерации, всего",0],
         ["4.1 Число врачей, прошедших обучение по программам дополнительного профессионального образования (повышение квалификации)",0],
         ["4.2 Число врачей, прошедших обучение по программам дополнительного профессионального образования (профессиональная переподготовка)",0],
         ["4.3 Число врачей, направленных на целевую подготовку в интернатуре",0],         
         ["4.4 Число врачей, направленных на целевую подготовку в ординатуре",0],
         ["4.5 Число врачей, завершивших обучение в интернатуре, всего",0],
         ["4.6 в том числе, завершивших обучение в целевой интернатуре",0],
         ["4.7 Число врачей, завершивших обучение в ординатуре, всего",0],         
         ["4.8 в том числе, завершивших обучение в целевой ординатуре",0],
         ["4.9 Число выпускников, трудоустроившихся в медицинских организациях государственной и муниципальной систем здравоохранения субъекта Российской Федерации после завершения обучения в целевой интернатуре",0],
         ["4.10 Число выпускников, трудоустроившихся в медицинских организациях государственной и муниципальной систем здравоохранения субъекта Российской Федерации после завершения обучения в целевой ординатуре",0],
         ["4.11 Число среднего медицинского персонала, направленного на целевую подготовку по программам среднего профессионального образования (базовая и углубленная подготовка)",0],
         ["4.12 Число специалистов со средним медицинским и фармацевтическим образованием, прошедших обучение по программам дополнительного образования в образовательных учреждениях среднего профессионального и дополнительного профессионального образования",0],
         ["4.13 Число бюджетных мест в образовательных учреждениях среднего профессионального образования, подведомственных субъекту Российской Федерации",0],
         ["4.14 Число внебюджетных мест в образовательных учреждениях среднего профессионального образования, подведомственных субъекту Российской Федерации",0],
         ["4.15 Число среднего медицинского персонала, трудоустроившихся в медицинских организациях государственной и муниципальной систем здравоохранения после завершения целевой подготовки по программам среднего профессионального образования (базовая и углубленная подготовка)",0],
         ]
       
    s[0][1]  = aq0['c2_1__sum']
    s[1][1]  = aq0['c2_2__sum']
    s[2][1]  = aq0['c2_3__sum']
    s[3][1]  = aq0['c2_3_1__sum']
    s[4][1]  = aq0['c2_3_2__sum']
    s[5][1]  = aq0['c2_3_3__sum']
    s[6][1]  = aq0['c2_4__sum']
    s[7][1]  = aq0['c2_4_1__sum']
    s[8][1]  = aq0['c2_4_2__sum']
    s[9][1]  = aq0['c2_4_3__sum']
    s[10][1]  = aq0['c2_5__sum']
    s[11][1]  = aq0['c2_5_1__sum']
    s[12][1]  = aq0['c2_5_2__sum']
    s[13][1]  = aq0['c2_5_3__sum']
    s[14][1]  = aq0['c2_5_4__sum']
    s[15][1]  = aq0['c2_5_5__sum']
    s[16][1]  = aq0['c2_5_6__sum']
    s[17][1]  = aq0['c2_5_7__sum']
    s[18][1]  = aq0['c2_5_8__sum']
    s[19][1]  = aq0['c2_5_9__sum']
    s[20][1]  = aq0['c2_5_10__sum']
    s[21][1]  = aq0['c2_5_11__sum']
    s[22][1]  = aq0['c2_5_12__sum']
    s[23][1]  = aq0['c2_5_13__sum']
    s[24][1]  = aq0['c2_5_14__sum']
    s[25][1]  = aq0['c2_5_15__sum']
    s[26][1]  = aq0['c2_5_16__sum']
    s[27][1]  = aq0['c2_5_17__sum']
    s[28][1]  = aq0['c2_5_18__sum']
    s[29][1]  = aq0['c2_5_19__sum']
    s[30][1]  = aq0['c2_5_20__sum']
    s[31][1]  = aq0['c2_5_21__sum']
    s[32][1]  = aq0['c2_5_22__sum']
    s[33][1]  = aq0['c2_5_23__sum']
    s[34][1]  = aq0['c2_5_24__sum']
    s[35][1]  = aq0['c2_5_25__sum']
    s[36][1]  = aq0['c2_5_26__sum']
    s[37][1]  = aq0['c2_5_27__sum']
    s[38][1]  = aq0['c2_5_28__sum']
    s[39][1]  = aq0['c2_5_29__sum']
    s[40][1]  = aq0['c2_5_30__sum']
    s[41][1]  = aq0['c2_5_31__sum']
    s[42][1]  = aq0['c2_5_32__sum']
    s[43][1]  = aq0['c2_5_33__sum']
    s[44][1]  = aq0['c2_5_34__sum']
    s[45][1]  = aq0['c2_5_35__sum']
    s[46][1]  = aq0['c2_5_36__sum']
    s[47][1]  = aq0['c2_5_37__sum']
    s[48][1]  = aq0['c2_5_38__sum']
    s[49][1]  = aq0['c2_5_39__sum']
    s[50][1]  = aq0['c2_5_40__sum']
    s[51][1]  = aq0['c2_5_41__sum']
    s[52][1]  = aq0['c2_6__sum']
    s[53][1]  = aq0['c2_7__sum']
    s[54][1]  = aq0['c2_8__sum']
    s[55][1]  = aq0['c2_9__sum']
    s[56][1]  = aq0['c2_10__sum']
    s[57][1]  = aq0['c2_11__sum']
    s[58][1]  = aq0['c2_12__sum']
    s[59][1]  = aq0['c2_13__sum']
    s[60][1]  = aq0['c2_13_1__sum']
    s[61][1]  = aq0['c2_13_2__sum']
    s[62][1]  = aq0['c2_13_3__sum']
    s[63][1]  = aq0['c2_13_4__sum']
    s[64][1]  = aq0['c2_13_5__sum']
    s[65][1]  = aq0['c2_13_6__sum']
    s[66][1]  = aq0['c2_13_7__sum']
    s[67][1]  = aq0['c2_13_8__sum']
    s[68][1]  = aq0['c2_13_9__sum']
    s[69][1]  = aq0['c2_13_10__sum']
    s[70][1]  = aq0['c2_13_11__sum']
    s[71][1]  = aq0['c2_13_12__sum']
    s[72][1]  = aq0['c2_13_13__sum']
    s[73][1]  = aq0['c2_13_14__sum']
    s[74][1]  = aq0['c2_13_15__sum']
    s[75][1]  = aq0['c2_13_16__sum']
    s[76][1]  = aq0['c2_13_17__sum']
    s[77][1]  = aq0['c2_13_18__sum']
    s[78][1]  = aq0['c2_13_19__sum']
    s[79][1]  = aq0['c2_13_20__sum']
    s[80][1]  = aq0['c2_13_21__sum']
    s[81][1]  = aq0['c2_13_22__sum']
    s[82][1]  = aq0['c2_13_23__sum']
    s[83][1]  = aq0['c2_13_24__sum']
    s[84][1]  = aq0['c2_13_25__sum']
    s[85][1]  = aq0['c2_13_26__sum']
    s[86][1]  = aq0['c2_13_27__sum']
    s[87][1]  = aq0['c2_13_28__sum']
    s[88][1]  = aq0['c2_13_29__sum']
    s[89][1]  = aq0['c2_13_30__sum']
    s[90][1]  = aq0['c2_13_31__sum']
    s[91][1]  = aq0['c2_13_32__sum']
    s[92][1]  = aq0['c2_13_33__sum']
    s[93][1]  = aq0['c2_13_34__sum']
    s[94][1]  = aq0['c2_13_35__sum']
    s[95][1]  = aq0['c2_13_36__sum']
    s[96][1]  = aq0['c2_13_37__sum']
    s[97][1]  = aq0['c2_13_38__sum']
    s[98][1]  = aq0['c2_13_39__sum']
    s[99][1]  = aq0['c2_13_40__sum']
    s[100][1]  = aq0['c2_13_41__sum']
    s[101][1]  = aq0['c2_13_42__sum']
    s[102][1]  = aq0['c2_13_43__sum']
    s[103][1]  = aq0['c2_13_44__sum']
    s[104][1]  = aq0['c2_13_45__sum']
    s[105][1]  = aq0['c2_13_46__sum']
    s[106][1]  = aq0['c2_13_47__sum']
    s[107][1]  = aq0['c2_13_48__sum']
    s[108][1]  = aq0['c2_13_49__sum']
    s[109][1]  = aq0['c2_13_50__sum']
    s[110][1]  = aq0['c2_13_51__sum']
    s[111][1]  = aq0['c2_13_52__sum']
    s[112][1]  = aq0['c2_13_53__sum']
    s[113][1]  = aq0['c2_13_54__sum']
    s[114][1]  = aq0['c2_13_55__sum']
    s[115][1]  = aq0['c2_13_56__sum']
    s[116][1]  = aq0['c2_13_57__sum']
    s[117][1]  = aq0['c2_13_58__sum']
    s[118][1]  = aq0['c2_13_59__sum']
    s[119][1]  = aq0['c2_13_60__sum']
    s[120][1]  = aq0['c2_13_61__sum']
    s[121][1]  = aq0['c2_13_62__sum']
    s[122][1]  = aq0['c2_13_63__sum']
    s[123][1]  = aq0['c2_13_64__sum']
    s[124][1]  = aq0['c2_13_65__sum']
    s[125][1]  = aq0['c2_13_66__sum']
    s[126][1]  = aq0['c2_13_67__sum']
    s[127][1]  = aq0['c2_13_68__sum']
    s[128][1]  = aq0['c2_13_69__sum']
    s[129][1]  = aq0['c2_13_70__sum']
    s[130][1]  = aq0['c2_13_71__sum']
    s[131][1]  = aq0['c2_13_72__sum']
    s[132][1]  = aq0['c2_13_73__sum']
    s[133][1]  = aq0['c2_13_74__sum']
    s[134][1]  = aq0['c2_13_75__sum']
    s[135][1]  = aq0['c2_13_76__sum']
    s[136][1]  = aq0['c2_13_77__sum']
    s[137][1]  = aq0['c2_13_78__sum']
    s[138][1]  = aq0['c2_13_79__sum']
    s[139][1]  = aq0['c2_13_80__sum']
    s[140][1]  = aq0['c2_13_81__sum']
    s[141][1]  = aq0['c2_13_82__sum']
    s[142][1]  = aq0['c2_13_83__sum']
    s[143][1]  = aq0['c2_13_84__sum']
    s[144][1]  = aq0['c2_13_85__sum']
    s[145][1]  = aq0['c2_13_86__sum']
    s[146][1]  = aq0['c2_13_87__sum']

    s[147][1]  = aq0['c2_13_89__sum']
    s[148][1]  = aq0['c2_13_90__sum']
    s[149][1]  = aq0['c2_13_91__sum']
    s[150][1]  = aq0['c2_13_92__sum']
    s[151][1]  = aq0['c2_13_93__sum']
    s[152][1]  = aq0['c2_13_94__sum']
    s[153][1]  = aq0['c2_13_95__sum']
    s[154][1]  = aq0['c2_13_96__sum']
    s[155][1]  = aq0['c2_13_97__sum']
    s[156][1]  = aq0['c2_13_98__sum']
    s[157][1]  = aq0['c2_13_99__sum']
    s[158][1]  = aq0['c2_13_100__sum']
    s[159][1]  = aq0['c2_13_101__sum']
    s[160][1]  = aq0['c2_13_102__sum']
    s[161][1]  = aq0['c2_13_103__sum']
    s[162][1]  = aq0['c2_13_104__sum']
    s[163][1]  = aq0['c2_13_105__sum']
    s[164][1]  = aq0['c2_13_106__sum']
    s[165][1]  = aq0['c2_13_107__sum']
    s[166][1]  = aq0['c2_13_108__sum']
    s[167][1]  = aq0['c2_13_109__sum']
    s[168][1]  = aq0['c2_13_110__sum']
    s[169][1]  = aq0['c2_13_111__sum']
    s[170][1]  = aq0['c2_13_112__sum']
    s[171][1]  = aq0['c2_13_113__sum']
    s[172][1]  = aq0['c2_13_114__sum']
    s[173][1]  = aq0['c2_13_115__sum']
    s[174][1]  = aq0['c2_13_116__sum']
    s[175][1]  = aq0['c2_13_117__sum']
    s[176][1]  = aq0['c2_13_118__sum']
    s[177][1]  = aq0['c2_13_119__sum']
    s[178][1]  = aq0['c2_13_120__sum']
    s[179][1]  = aq0['c2_13_121__sum']
    s[180][1]  = aq0['c2_13_122__sum']
    s[181][1]  = aq0['c2_13_123__sum']
    s[182][1]  = aq0['c2_13_124__sum']

    s[183][1]  = aq1['c2_14_1__sum']
    s[184][1]  = aq1['c2_14_2__sum']
    s[185][1]  = aq1['c2_14_3__sum']
    s[186][1]  = aq1['c2_14_4__sum']
    s[187][1]  = aq1['c2_14_5__sum']
    s[188][1]  = aq1['c2_14_6__sum']
    s[189][1]  = aq1['c2_14_7__sum']
    s[190][1]  = aq1['c2_14_8__sum']
    s[191][1]  = aq1['c2_14_9__sum']
    s[192][1]  = aq1['c2_14_10__sum']
    s[193][1]  = aq1['c2_14_11__sum']
    s[194][1]  = aq1['c2_14_12__sum']
    s[195][1]  = aq1['c2_14_13__sum']
    s[196][1]  = aq1['c2_14_14__sum']
    s[197][1]  = aq1['c2_14_15__sum']
    s[198][1]  = aq1['c2_14_16__sum']
    s[199][1]  = aq1['c2_14_17__sum']
    s[200][1]  = aq1['c2_14_18__sum']
    s[201][1]  = aq1['c2_14_19__sum']
    s[202][1]  = aq1['c2_14_20__sum']
    s[203][1]  = aq1['c2_14_21__sum']
    s[204][1]  = aq1['c2_14_22__sum']
    s[205][1]  = aq1['c2_14_23__sum']
    s[206][1]  = aq1['c2_14_24__sum']
    s[207][1]  = aq1['c2_14_25__sum']
    s[208][1]  = aq1['c2_14_26__sum']
    s[209][1]  = aq1['c2_14_27__sum']
    s[210][1]  = aq1['c2_14_28__sum']
    s[211][1]  = aq1['c2_14_29__sum']
    s[212][1]  = aq1['c2_14_30__sum']
    s[213][1]  = aq1['c2_14_31__sum']
    s[214][1]  = aq1['c2_14_32__sum']
    s[215][1]  = aq1['c2_14_33__sum']
    s[216][1]  = aq1['c2_14_34__sum']
    s[217][1]  = aq1['c2_14_35__sum']
    s[218][1]  = aq1['c2_14_36__sum']
    s[219][1]  = aq1['c2_14_37__sum']
    s[220][1]  = aq1['c2_14_38__sum']
    s[221][1]  = aq1['c2_14_39__sum']
    s[222][1]  = aq1['c2_14_40__sum']
    s[223][1]  = aq1['c2_14_41__sum']
    s[224][1]  = aq1['c2_14_42__sum']
    s[225][1]  = aq1['c2_14_43__sum']
    s[226][1]  = aq1['c2_14_44__sum']
    s[227][1]  = aq1['c2_14_45__sum']

    s[228][1]  = aq1['c2_15__sum']
    s[229][1]  = aq1['c2_16__sum']
    s[230][1]  = aq1['c2_17__sum']
    s[231][1]  = aq1['c2_18__sum']
    s[232][1]  = aq1['c2_19__sum']
    s[233][1]  = aq1['c2_20__sum']
    s[234][1]  = aq1['c2_21__sum']
    s[235][1]  = aq1['c2_22__sum']
    s[236][1]  = aq1['c2_23__sum']
    s[237][1]  = aq1['c2_24__sum']
    s[238][1]  = aq1['c2_25__sum']
    s[239][1]  = aq1['c2_26__sum']
    s[240][1]  = aq1['c2_27__sum']
    s[241][1]  = aq1['c2_28__sum']

    s[242][1]  = aq1['c3_1__sum']
    s[243][1]  = aq1['c3_2__sum']
    s[244][1]  = aq1['c3_3__sum']
    s[245][1]  = aq1['c3_4__sum']
    s[246][1]  = aq1['c3_5__sum']
    s[247][1]  = aq1['c3_6__sum']
    s[248][1]  = aq1['c3_7__sum']
    s[249][1]  = aq1['c3_8__sum']
    s[250][1]  = aq1['c3_9__sum']
    s[251][1]  = aq1['c3_10__sum']
    s[252][1]  = aq1['c3_11__sum']
    s[253][1]  = aq1['c3_12__sum']
    s[254][1]  = aq1['c3_13__sum']
    s[255][1]  = aq1['c3_14__sum']
    s[256][1]  = aq1['c3_15__sum']
    s[257][1]  = aq1['c3_16__sum']
    s[258][1]  = aq1['c3_17__sum']
    s[259][1]  = aq1['c3_18__sum']
    s[260][1]  = aq1['c3_19__sum']
    s[261][1]  = aq1['c3_20__sum']
    s[262][1]  = aq1['c3_21__sum']
    s[263][1]  = aq1['c3_22__sum']
    s[264][1]  = aq1['c3_23__sum']
    s[265][1]  = aq1['c3_24__sum']
    s[266][1]  = aq1['c3_25__sum']
    s[267][1]  = aq1['c3_26__sum']
    s[268][1]  = aq1['c3_27__sum']
    s[269][1]  = aq1['c3_28__sum']
    s[270][1]  = aq1['c3_29__sum']
    s[271][1]  = aq1['c3_30__sum']
    s[272][1]  = aq1['c3_31__sum']
    s[273][1]  = aq1['c3_32__sum']
    s[274][1]  = aq1['c3_33__sum']
    s[275][1]  = aq1['c3_34__sum']
    s[276][1]  = aq1['c3_35__sum']
    s[277][1]  = aq1['c3_36__sum']
    s[278][1]  = aq1['c3_37__sum']
    s[279][1]  = aq1['c3_38__sum']

    s[280][1]  = aq1['c4_1__sum']
    s[281][1]  = aq1['c4_2__sum']
    s[282][1]  = aq1['c4_3__sum']
    s[283][1]  = aq1['c4_4__sum']
    s[284][1]  = aq1['c4_5__sum']
    s[285][1]  = aq1['c4_6__sum']
    s[286][1]  = aq1['c4_7__sum']
    s[287][1]  = aq1['c4_8__sum']
    s[288][1]  = aq1['c4_9__sum']
    s[289][1]  = aq1['c4_10__sum']
    s[290][1]  = aq1['c4_11__sum']
    s[291][1]  = aq1['c4_12__sum']
    s[292][1]  = aq1['c4_13__sum']
    s[293][1]  = aq1['c4_14__sum']
    s[294][1]  = aq1['c4_15__sum']

    return s

def exp_to_excel_form2(doc, iperiod, iregion, mode, stat = None):    # mode = 0 по региону или группе больниц  mode = 1 - по конкретной больнице
    res =  calc_sum_form2(doc)
    speriod = get_period_namef(iperiod)
    sregion = get_region_name(mode,doc,iregion)
    name_file = get_name("/medicament/Form/Form1.xlsx")

    wb = openpyxl.load_workbook(name_file)
    sheet = wb.active
    sheet['B2'] = speriod
    sheet['A1'] = sregion
    if mode==0:
        sheet['A20'] = "Статистика по отчету"  
        sheet['A21'] = "Организаций предоставляющих, Всего"
        sheet['B21'] = stat.rec_all
        sheet['A22'] = "Отобрано в отчет, Всего"
        sheet['B22'] = stat.rec_fltr
        sheet['A23'] = "Завершено"
        sheet['B23'] = stat.rec_complete
        sheet['A24'] = "Согласование"
        sheet['B24'] = stat.rec_soglas
        sheet['A25'] = "Корректировка"
        sheet['B25'] = stat.rec_correct
        sheet['A26'] = "Редактирование"
        sheet['B26'] = stat.rec_edit

    sheet['A28'] = "Выведено в системе Мед+ " + str(datetime.now()) 
    sheet['A28'].font = Font(size=5)

    
    sheet['B8'] = res[0][1]
    sheet['C8'] = res[0][2]
    sheet['D8'] = res[0][3]
    sheet['E8'] = res[0][4]
    sheet['F8'] = res[0][5]

    sheet['G10'] = res[1][6]
    sheet['H10'] = res[1][7]
    sheet['I10'] = res[1][8]

    sheet['B11'] = res[2][1]
    sheet['C11'] = res[2][2]
    sheet['D11'] = res[2][3]
    sheet['E11'] = res[2][4]
    sheet['F11'] = res[2][5]
    sheet['G11'] = res[2][6]
    sheet['H11'] = res[2][7]
    sheet['I11'] = res[2][8]

    sheet['B13'] = res[3][1]
    sheet['C13'] = res[3][2]
    sheet['D13'] = res[3][3]
    sheet['E13'] = res[3][4]
    sheet['F13'] = res[3][5]
    sheet['G13'] = res[3][6]
    sheet['H13'] = res[3][7]
    sheet['I13'] = res[3][8]


 #   name_file =  get_name("\\medicament\\Form\\rep" + str(int(random()*100000000)) + ".xlsx") 
    name_file =  get_name("/medicament/Form/rep" + str(int(random()*100000000)) + ".xlsx") 
    wb.save(name_file)
    
    return name_file


    
